Autodesk.Revit.DB.Structure.FabricSheet.IsNotBent
Method to verify that a fabric sheet is flat.
Returns:
True for flat fabric sheet, false for bent fabric sheet.
Since:
2026

Autodesk.Revit.DB.Structure.FabricSheet.DistributionOfWiresAtCover
The distribution of wires that is closest to the cover.
Remarks:
This parameter is only relevant for instances of flat fabric sheets.
Fabric sheets are created with the Major distribution set at the cover by default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This fabric sheet is bent. Method shall be called only for flat fabric sheets.
Since:
2026

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricStraightWiresLocation
Specifies the location of straight bars with respect to bent bars in the fabric sheet.
Remarks:
This parameter applies only to bent fabric sheets.
The side on wich straight wires will be loacted is determined by the start and end point of the first bent profile segment that specifies the direction of the curve loop on plane.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2017

Autodesk.Revit.DB.Structure.FabricSheet.BentFabricBendDirection
Specifies which wire direction of the fabric sheet is bent.
Remarks:
This parameter applies only to bent fabric sheets.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidObjectException:
When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
Since:
2016